wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Examples/IPA/IPA_image_scaling/main.c
/*!
    \file    main.c
    \brief   IPA image scaling demo

    \version 2025-09-29, V0.2.0, firmware for GD32H77x
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32h77x.h"
#include <stdio.h>
#include "systick.h"
#include "gd32h77ei_eval.h"
#include "image_lena.h"

#define HORIZONTAL_SYNCHRONOUS_PULSE  41
#define HORIZONTAL_BACK_PORCH         2
#define ACTIVE_WIDTH                  480
#define HORIZONTAL_FRONT_PORCH        2

#define VERTICAL_SYNCHRONOUS_PULSE    10
#define VERTICAL_BACK_PORCH           2
#define ACTIVE_HEIGHT                 272
#define VERTICAL_FRONT_PORCH          2

#define AXI_SRAM_ADDR                 0x24000000

#define SPACE_WIDTH                   64
#define SPACE_HEIGHT                  64

__ALIGNED(16) uint8_t test_foreground[SPACE_WIDTH * SPACE_HEIGHT * 4 + 12] = {0};
__ALIGNED(16) uint8_t test_destination_1[SPACE_WIDTH * SPACE_HEIGHT * 4 * 4 + 12] = {0};
__ALIGNED(16) uint8_t test_destination_2[SPACE_WIDTH * SPACE_HEIGHT * 4 * 4 + 12] = {0};

uint32_t test_width  = 64;
uint32_t test_height = 64;

uint32_t scaling_width  = 32;
uint32_t scaling_height = 32;

tli_parameter_struct               tli_init_struct;
tli_layer_parameter_struct         tli_layer0_init_struct;
tli_layer_parameter_struct         tli_layer1_init_struct;

/* private function prototypes */
static void ipa_config(uint32_t *fore_buf, uint32_t *dest_buf);
static void tli_config(uint32_t test_width, uint32_t test_height);
static void tli_gpio_config(void);
void cache_enable(void);
void mpu_config(void);

/*!
    \brief      main function
    \param[in]  none
    \param[out] none
    \retval     none
*/
int main(void)
{
    /* enable the CPU cache */
    cache_enable();
    /* configure MPU */
    mpu_config();
    systick_config();

    /* initialize TLI and TLI layer */
    tli_config(test_width, test_height);
    tli_layer_enable(LAYER0);
    tli_layer_enable(LAYER1);
    tli_reload_config(TLI_REQUEST_RELOAD_EN);
    tli_enable();

    /* IPA configuration */
    ipa_config((uint32_t *)&test_foreground, (uint32_t *)&test_destination_1);

    uint32_t i, h = 0, v = 0;
    /* copy the image from FLASH to test_foreground */
    for(v = 0, i = 0; v < test_height; v++) {
        for(h = 0; h < test_width; h++) {
            test_foreground[(v * test_width + h) * 4 + 0] = (uint8_t)(img_lena[i] & 0x000000FF);
            test_foreground[(v * test_width + h) * 4 + 1] = (uint8_t)((img_lena[i] & 0x0000FF00) >> 8);
            test_foreground[(v * test_width + h) * 4 + 2] = (uint8_t)((img_lena[i] & 0x00FF0000) >> 16);
            test_foreground[(v * test_width + h) * 4 + 3] = (uint8_t)((img_lena[i] & 0xFF000000) >> 24);
            i++;
        }
    }

    /* specify the size of scaling */
    scaling_width = 64;
    scaling_height = 32;
    static uint8_t flag = 0;
    while(scaling_width <= (SPACE_WIDTH * 2) && scaling_height <= (SPACE_HEIGHT * 2) &&
            scaling_width >= (SPACE_WIDTH / 2) && scaling_height >= (SPACE_HEIGHT / 2)) {
        /* configure different destination sources */
        if(0 == flag) {
            ipa_config((uint32_t *)&test_foreground, (uint32_t *)&test_destination_2);
            flag = 1;
        } else {
            ipa_config((uint32_t *)&test_foreground, (uint32_t *)&test_destination_1);
            flag = 0;
        }
        /* configure foreground and destination scaling */
        ipa_foreground_scaling_config(DESTINATION_HORDECIMATE_DISABLE, DESTINATION_VERDECIMATE_DISABLE, (((uint64_t)test_width << 12) / scaling_width),
                                      (((uint64_t)test_height << 12) / scaling_height));
        ipa_destination_scaling_config(scaling_width, scaling_height);

        /* reconfigure TLI layer */
        tli_layer1_init_struct.layer_window_leftpos          = (180 + HORIZONTAL_SYNCHRONOUS_PULSE + HORIZONTAL_BACK_PORCH);
        tli_layer1_init_struct.layer_window_rightpos         = (180 + scaling_width + HORIZONTAL_SYNCHRONOUS_PULSE + HORIZONTAL_BACK_PORCH - 1);
        tli_layer1_init_struct.layer_window_toppos           = 60 + VERTICAL_SYNCHRONOUS_PULSE + VERTICAL_BACK_PORCH;
        tli_layer1_init_struct.layer_window_bottompos        = 60 + scaling_height + VERTICAL_SYNCHRONOUS_PULSE + VERTICAL_BACK_PORCH - 1;
        tli_layer1_init_struct.layer_frame_line_length       = ((scaling_width * 4) + 7);
        tli_layer1_init_struct.layer_frame_buf_stride_offset = ((scaling_width * 4));
        tli_layer1_init_struct.layer_frame_total_line_number = scaling_height;
        if(0 == flag) {
            tli_layer1_init_struct.layer_frame_bufaddr = (uint32_t)&test_destination_1;
        } else {
            tli_layer1_init_struct.layer_frame_bufaddr = (uint32_t)&test_destination_2;
        }
        tli_layer_init(LAYER1, &tli_layer1_init_struct);
        /* disable TLI layer */
        tli_layer_disable(LAYER1);
        tli_reload_config(TLI_FRAME_BLANK_RELOAD_EN);

        /* start IPA transfer */
        ipa_transfer_enable();
        while(ipa_flag_get(IPA_FLAG_FTF) == RESET) {
        }
        /* enable TLI layer */
        tli_layer_enable(LAYER1);
        tli_reload_config(TLI_FRAME_BLANK_RELOAD_EN);
        ipa_flag_clear(IPA_FLAG_FTF);

        scaling_height++;
        delay_1ms(20);
    }

    /* specify the size of scaling */
    scaling_width = 32;
    scaling_height = 64;
    flag = 0;
    while(scaling_width <= (SPACE_WIDTH * 2) && scaling_height <= (SPACE_HEIGHT * 2) &&
            scaling_width >= (SPACE_WIDTH / 2) && scaling_height >= (SPACE_HEIGHT / 2)) {
        /* configure different destination sources */
        if(0 == flag) {
            ipa_config((uint32_t *)&test_foreground, (uint32_t *)&test_destination_2);
            flag = 1;
        } else {
            ipa_config((uint32_t *)&test_foreground, (uint32_t *)&test_destination_1);
            flag = 0;
        }
        /* configure foreground and destination scaling */
        ipa_foreground_scaling_config(DESTINATION_HORDECIMATE_DISABLE, DESTINATION_VERDECIMATE_DISABLE, (((uint64_t)test_width << 12) / scaling_width),
                                      (((uint64_t)test_height << 12) / scaling_height));
        ipa_destination_scaling_config(scaling_width, scaling_height);

        /* reconfigure TLI layer */
        tli_layer1_init_struct.layer_window_leftpos          = (180 + HORIZONTAL_SYNCHRONOUS_PULSE + HORIZONTAL_BACK_PORCH);
        tli_layer1_init_struct.layer_window_rightpos         = (180 + scaling_width + HORIZONTAL_SYNCHRONOUS_PULSE + HORIZONTAL_BACK_PORCH - 1);
        tli_layer1_init_struct.layer_window_toppos           = (60 + VERTICAL_SYNCHRONOUS_PULSE + VERTICAL_BACK_PORCH);
        tli_layer1_init_struct.layer_window_bottompos        = (60 + scaling_height + VERTICAL_SYNCHRONOUS_PULSE + VERTICAL_BACK_PORCH - 1);
        tli_layer1_init_struct.layer_frame_line_length       = ((scaling_width * 4) + 7);
        tli_layer1_init_struct.layer_frame_buf_stride_offset = ((scaling_width * 4));
        tli_layer1_init_struct.layer_frame_total_line_number = scaling_height;
        if(0 == flag) {
            tli_layer1_init_struct.layer_frame_bufaddr = (uint32_t)&test_destination_1;
        } else {
            tli_layer1_init_struct.layer_frame_bufaddr = (uint32_t)&test_destination_2;
        }
        tli_layer_init(LAYER1, &tli_layer1_init_struct);
        /* disable TLI layer */
        tli_layer_disable(LAYER1);
        tli_reload_config(TLI_FRAME_BLANK_RELOAD_EN);

        /* start IPA transfer */
        ipa_transfer_enable();
        while(ipa_flag_get(IPA_FLAG_FTF) == RESET) {
        }
        /* enable TLI layer */
        tli_layer_enable(LAYER1);
        tli_reload_config(TLI_FRAME_BLANK_RELOAD_EN);
        ipa_flag_clear(IPA_FLAG_FTF);

        scaling_width++;
        delay_1ms(20);
    }

    /* specify the size of scaling */
    scaling_width = 32;
    scaling_height = 32;
    flag = 0;
    while(scaling_width <= (SPACE_WIDTH * 2) && scaling_height <= (SPACE_HEIGHT * 2) &&
            scaling_width >= (SPACE_WIDTH / 2) && scaling_height >= (SPACE_HEIGHT / 2)) {
        /* configure different destination sources */
        if(0 == flag) {
            ipa_config((uint32_t *)&test_foreground, (uint32_t *)&test_destination_2);
            flag = 1;
        } else {
            ipa_config((uint32_t *)&test_foreground, (uint32_t *)&test_destination_1);
            flag = 0;
        }
        /* configure foreground and destination scaling */
        ipa_foreground_scaling_config(DESTINATION_HORDECIMATE_DISABLE, DESTINATION_VERDECIMATE_DISABLE, (((uint64_t)test_width << 12) / scaling_width),
                                      (((uint64_t)test_height << 12) / scaling_height));
        ipa_destination_scaling_config(scaling_width, scaling_height);

        /* reconfigure TLI layer */
        tli_layer1_init_struct.layer_window_leftpos          = (180 + HORIZONTAL_SYNCHRONOUS_PULSE + HORIZONTAL_BACK_PORCH);
        tli_layer1_init_struct.layer_window_rightpos         = (180 + scaling_width + HORIZONTAL_SYNCHRONOUS_PULSE + HORIZONTAL_BACK_PORCH - 1);
        tli_layer1_init_struct.layer_window_toppos           = (60 + VERTICAL_SYNCHRONOUS_PULSE + VERTICAL_BACK_PORCH);
        tli_layer1_init_struct.layer_window_bottompos        = (60 + scaling_height + VERTICAL_SYNCHRONOUS_PULSE + VERTICAL_BACK_PORCH - 1);
        tli_layer1_init_struct.layer_frame_line_length       = ((scaling_width * 4) + 7);
        tli_layer1_init_struct.layer_frame_buf_stride_offset = ((scaling_width * 4));
        tli_layer1_init_struct.layer_frame_total_line_number = scaling_height;
        if(0 == flag) {
            tli_layer1_init_struct.layer_frame_bufaddr = (uint32_t)&test_destination_1;
        } else {
            tli_layer1_init_struct.layer_frame_bufaddr = (uint32_t)&test_destination_2;
        }
        tli_layer_init(LAYER1, &tli_layer1_init_struct);
        /* disable TLI layer */
        tli_layer_disable(LAYER1);
        tli_reload_config(TLI_FRAME_BLANK_RELOAD_EN);

        /* start IPA transfer */
        ipa_transfer_enable();
        while(ipa_flag_get(IPA_FLAG_FTF) == RESET) {
        }
        /* enable TLI layer */
        tli_layer_enable(LAYER1);
        tli_reload_config(TLI_FRAME_BLANK_RELOAD_EN);
        ipa_flag_clear(IPA_FLAG_FTF);

        scaling_width++;
        scaling_height++;
        delay_1ms(10);
    }
            
    while(1) {
    }
}

/*!
    \brief      IPA initialize and configuration
    \param[in]  fore_buf: foreground buffer address
    \param[in]  dest_buf: destination buffer address
    \param[out] none
    \retval     none
*/
static void ipa_config(uint32_t *fore_buf, uint32_t *dest_buf)
{
    ipa_destination_parameter_struct  ipa_destination_init_struct;
    ipa_foreground_parameter_struct   ipa_fg_init_struct;
    ipa_background_parameter_struct   ipa_bg_init_struct;

    rcu_periph_clock_enable(RCU_IPA);
    ipa_deinit();

    ipa_foreground_struct_para_init(&ipa_fg_init_struct);
    ipa_background_struct_para_init(&ipa_bg_init_struct);
    ipa_destination_struct_para_init(&ipa_destination_init_struct);

